const express = require('express')
const basicAuth = require('express-basic-auth')
const slowDown = require("express-slow-down");
const logger = require('./log/logger')
const httpLogger = require('./log/httpLogger')
const Net = require('net');

const app = express()
const httpPort = 3000
const tcpPort = 9100
const server = Net.createServer()

const speedLimiter = slowDown({
    windowMs: 15 * 60 * 1000, // 15 minutes
    // delayAfter: 1, // allow 100 requests per 15 minutes, then...
    delayMs: 3000 // begin adding 500ms of delay per request above 100:
});
app.use(httpLogger)
//app.use(speedLimiter);

let isUseAuth = false
if (isUseAuth) {
    app.use(basicAuth({
        users: {'tsd': 'tsd159753'},
        unauthorizedResponse: getUnauthorizedResponse
    }))
}

function getUnauthorizedResponse(req) {
    return req.auth
        ? ('Credentials ' + req.auth.user + ':' + req.auth.password + ' rejected')
        : 'No credentials provided'
}

server.listen(tcpPort, function () {
    console.log('TCP Server is running on port ' + tcpPort + '.');
});

let sockets = [];
server.on('connection', function (sock) {
    console.log('CONNECTED: ' + sock.remoteAddress + ':' + sock.remotePort);
    sockets.push(sock);
    sock.on('data', function (data) {
        console.log('DATA ' + sock.remoteAddress + ': ' + data);
// Write the data back to all the connected, the client will receive it as data from the server
        sockets.forEach(function (sock, index, array) {
            sock.write(sock.remoteAddress + ':' + sock.remotePort + " said " + data + '\n');
        });
    });
// Add a 'close' event handler to this instance of socket
    sock.on('close', function (data) {
        let index = sockets.findIndex(function (o) {
            return o.remoteAddress === sock.remoteAddress && o.remotePort === sock.remotePort;
        })
        if (index !== -1) sockets.splice(index, 1);
        console.log('CLOSED: ' + sock.remoteAddress + ' ' + sock.remotePort);
    });
});
app.get('/Tech/hs/tsd/users/get', (req, res) => {
    logger.info(req.hostname + " запрос списка пользователей")
    res.contentType("application/json")
    res.json([
        {
            "Код": "000000001",
            "Наименование": "Оператор",
            "Пароль": "123"
        },
        {
            "Код": "000000002",
            "Наименование": "Директор",
            "Пароль": "321"
        },
        {
            "Код": "000000003",
            "Наименование": "Капуста Иван",
            "Пароль": "159753"
        },
        {
            "Код": "000000004",
            "Наименование": "Петров Василий",
            "Пароль": "111"
        },
        {
            "Код": "000000005",
            "Наименование": "Пупкин Дормидонт",
            "Пароль": "222"
        }
    ])
});
app.get('/Tech/hs/tsd/shops/get', (req, res) => {
    logger.info(req.hostname + " запрос списка магазинов")
    res.contentType("application/json")
    res.json([
        {
            "Префикс": "Д87",
            "Наименование": "88.87:3000",
            "Адрес": "192.168.88.87:3000",
            "Сервис": "TSD88",
            "Шаблоны": [
                "22ТТТТТМММММК"
            ]
        },
        {
            "Префикс": "Д230",
            "Наименование": "1.230:3000",
            "Адрес": "10.254.1.230:3000",
            "Сервис": "TSD230",
            "Шаблоны": [
                "22ТТТТТМММММК"
            ]
        },
        {
            "Префикс": "Д80",
            "Наименование": "Десяточка №49 Юбилейный, 28",
            "Адрес": "10.150.10.10",
            "Сервис": "TSD",
            "Шаблоны": [
                "22ТТТТТМММММК"
            ]
        },
        {
            "Префикс": "ЯЯЯ",
            "Наименование": " Тестовый магазин",
            "Адрес": "192.168.0.154",
            "Сервис": "TSD10",
            "Шаблоны": [
                "22ТТТТТМММММК"
            ]
        },
        {
            "Префикс": "Д56",
            "Наименование": "Десяточка №34 Скворцова",
            "Адрес": "10.150.34.100",
            "Сервис": "TSD",
            "Шаблоны": [
                "22ТТТТТМММММК",
                "27ПППППМММММК"
            ]
        },
        {
            "Префикс": "Д66",
            "Наименование": "Десяточка №44 Нея",
            "Адрес": "10.150.44.100",
            "Сервис": "TSD44",
            "Шаблоны": [
                "22ТТТТТМММММК"
            ]
        }
    ])
});
app.get('/Tech/hs/tsd/printers/get', (req, res) => {
    logger.info(req.hostname + " запрос списка принтеров")
    res.contentType("application/json")
    res.json({
        "printers": [
            {
                "ip": "192.168.88.17",
                "sn": "323WG20821002",
                "model": "XP-P323B"
            },
            {
                "ip": "10.254.1.230",
                "sn": "323WG76854802",
                "model": "XP-P353B"
            }
            ,
            {
                "ip": "192.168.88.87",
                "sn": "323WG76854802",
                "model": "XP-P353B"
            },
            {
                "ip": "192.168.88.12",
                "sn": "323WG76854802",
                "model": "XP-P353B"
            },
            {
                "ip": "192.168.88.13",
                "sn": "323WG76854802",
                "model": "XP-P353B"
            }
        ]
    })
});

app.get('/TSD*/hs/tsd/printers/get', (req, res) => {
    logger.info(req.hostname + " запрос списка принтеров магазина TSD230")
    res.contentType("application/json")
    res.json({
        "printers": [
            {
                "ip": "192.168.88.17",
                "sn": "323WG20821002",
                "model": "XP-P323B"
            },
            {
                "ip": "10.254.1.230",
                "sn": "323WG76854802",
                "model": "XP-P353B"
            }
            ,
            {
                "ip": "192.168.88.87",
                "sn": "323WG76854802",
                "model": "XP-P353B"
            },
            {
                "ip": "192.168.88.12",
                "sn": "323WG76854802",
                "model": "XP-P353B"
            },
            {
                "ip": "192.168.88.13",
                "sn": "323WG76854802",
                "model": "XP-P353B"
            }
        ]
    })
});
app.get('/TSD*/hs/tsd/getgrouplist', (req, res) => {
    logger.info(req.hostname + " запрос списка групп товаров")
    res.contentType("application/json")
    if (req.query.filter) {
        res.json({
            "result": "success",
            "message": "",
            "nomenclature": [
                {
                    "name": "Соль черная пищевая  140г Туба \\56шт Смол",
                    "code": "85925",
                    "price": "59",
                    "plu": "0",
                    "barcode": "1056614410062"
                },
                {
                    "name": "Соль черная пищевая  140г Туба \\56шт Смол",
                    "code": "85925",
                    "price": "59",
                    "plu": "0",
                    "barcode": "4631137332649"
                },
                {
                    "name": "Мука В\\С г.Владимир\\50кг",
                    "code": "82807",
                    "price": "32.5",
                    "plu": "2 435",
                    "barcode": ""
                },
                {
                    "name": "Соль морск.Помол№0 МЕЛКАЯ'Marbelle'500г\\18ш",
                    "code": "93599",
                    "price": "84.9",
                    "plu": "0",
                    "barcode": "4607012292728"
                },
                {
                    "name": "Мука 1сорт г.Нижний Новгород\\50кг",
                    "code": "62578",
                    "price": "15.2",
                    "plu": "7",
                    "barcode": ""
                },
                {
                    "name": "Сахар -Рафин.Чайкофский 0,25 кг./40 шт.",
                    "code": "91957",
                    "price": "25.9",
                    "plu": "0",
                    "barcode": "4607046122794"
                },
                {
                    "name": "Сахар -Рафин.Чайкофский 0,25 кг./40 шт.",
                    "code": "91957",
                    "price": "25.9",
                    "plu": "0",
                    "barcode": "4607078680422"
                },
                {
                    "name": "Сахар Кусковой Крупный \\20кг",
                    "code": "10001",
                    "price": "86.9",
                    "plu": "1",
                    "barcode": "2210001006941"
                },
                {
                    "name": "Сахар Кусковой Мелкий\\20кг",
                    "code": "10002",
                    "price": "86.9",
                    "plu": "2",
                    "barcode": ""
                },
                {
                    "name": "Сахар -рафин.прес.б\\р Фигурный 450г\\20",
                    "code": "23358",
                    "price": "37.5",
                    "plu": "0",
                    "barcode": "4607031241813"
                },
                {
                    "name": "Сахар -рафин.прес.б\\р Фигурный 450г\\20",
                    "code": "23358",
                    "price": "37.5",
                    "plu": "0",
                    "barcode": "4607076841887"
                },
                {
                    "name": "Сахар -рафин.прес.б\\р Фигурный 900г\\10",
                    "code": "23362",
                    "price": "72.9",
                    "plu": "0",
                    "barcode": "4607076841894"
                },
                {
                    "name": "Сахар -рафин.прес.б\\р Фигурный 900г\\10",
                    "code": "23362",
                    "price": "72.9",
                    "plu": "0",
                    "barcode": "4607142980137"
                },
                {
                    "name": "Сахар Мистраль 500г Демерара нерафинированный тростниковый в кубиках /16",
                    "code": "99065",
                    "price": "145.5",
                    "plu": "0",
                    "barcode": "4601916004241"
                },
                {
                    "name": "Сахар Мистраль 900г Демерара нерафинированый тростниковый /12",
                    "code": "99064",
                    "price": "223.5",
                    "plu": "0",
                    "barcode": "4601916001745"
                },
                {
                    "name": "Сахар корич.Универ.1кг МИСТРАЛЬ \\12ш",
                    "code": "37852",
                    "price": "179.9",
                    "plu": "0",
                    "barcode": "4601916001721"
                },
                {
                    "name": "Сахар -Рафин.Чайкофский 0,5кг\\40",
                    "code": "10003",
                    "price": "45",
                    "plu": "0",
                    "barcode": "4607046120055"
                },
                {
                    "name": "Сахар -Рафин.Чайкофский 0,5кг\\40",
                    "code": "10003",
                    "price": "45",
                    "plu": "0",
                    "barcode": "4607046120059"
                },
                {
                    "name": "Сахар -Рафин.Чайкофский 1кг\\20",
                    "code": "10004",
                    "price": "83.9",
                    "plu": "0",
                    "barcode": "4607046120066"
                },
                {
                    "name": "Сахар -Рафин.Чайкофский 1кг\\20",
                    "code": "10004",
                    "price": "83.9",
                    "plu": "0",
                    "barcode": "4607046120462"
                },
                {
                    "name": "Сахар белый кусковой фигурный Монкафе Чайкофский 0,5кг\\",
                    "code": "46484",
                    "price": "52.9",
                    "plu": "0",
                    "barcode": "4607046120899"
                },
                {
                    "name": "Сахар-раф. Русский 0,25кг\\80",
                    "code": "22120",
                    "price": "25.5",
                    "plu": "0",
                    "barcode": "4607046121117"
                },
                {
                    "name": "Сахар-раф. Русский 0,5кг\\40",
                    "code": "38233",
                    "price": "42.5",
                    "plu": "0",
                    "barcode": "4607046120141"
                },
                {
                    "name": "Сахар-раф. Русский, Хороший 1кг\\20",
                    "code": "26464",
                    "price": "81.5",
                    "plu": "0",
                    "barcode": "4607046120127"
                },
                {
                    "name": "Сахар-раф. Русский, Хороший 1кг\\20",
                    "code": "26464",
                    "price": "81.5",
                    "plu": "0",
                    "barcode": "4607046123906"
                },
                {
                    "name": "Сахар -Б\\р У Самовара Коробка 450г\\24ш",
                    "code": "39545",
                    "price": "37.9",
                    "plu": "0",
                    "barcode": "4607078680385"
                },
                {
                    "name": "Сахар -Б\\р У Самовара Коробка 450г\\24ш",
                    "code": "39545",
                    "price": "37.9",
                    "plu": "0",
                    "barcode": "4607078680408"
                },
                {
                    "name": "Сахар -Б\\р У Самовара Коробка 900г\\20ш",
                    "code": "39547",
                    "price": "74.5",
                    "plu": "0",
                    "barcode": "4607078680392"
                },
                {
                    "name": "Сахар -Б\\р У Самовара Коробка 900г\\20ш",
                    "code": "39547",
                    "price": "74.5",
                    "plu": "0",
                    "barcode": "4607078680415"
                },
                {
                    "name": "Сахар -Б\\р У Самовара Коробка 900г\\20ш",
                    "code": "39547",
                    "price": "74.5",
                    "plu": "0",
                    "barcode": "4607078680446"
                },
                {
                    "name": "Сахар -Фрук.-Яг.Контейнер 400г\\24ш",
                    "code": "73854",
                    "price": "30.9",
                    "plu": "0",
                    "barcode": "4607078680262"
                },
                {
                    "name": "Сахар -Фрук.-Яг.Коробка 400г\\24ш",
                    "code": "70858",
                    "price": "49.9",
                    "plu": "0",
                    "barcode": "4607078680293"
                },
                {
                    "name": "Сахар -Фрук.-Яг.Коробка 800г\\12ш",
                    "code": "70859",
                    "price": "72.9",
                    "plu": "0",
                    "barcode": "4607078680286"
                },
                {
                    "name": "Сахар-песок 1кг Антошка /12шт",
                    "code": "14473",
                    "price": "49.9",
                    "plu": "0",
                    "barcode": "1098624400992"
                },
                {
                    "name": "Сахар-песок по 0,9кг фас.!!!\\12шт",
                    "code": "20713",
                    "price": "49.9",
                    "plu": "0",
                    "barcode": "1098624400336"
                },
                {
                    "name": "Сахар-песок 10кг фас. !!!\\1*10 МЕШОК!",
                    "code": "77636",
                    "price": "499",
                    "plu": "0",
                    "barcode": "1098624401647"
                },
                {
                    "name": "Сахар-песок 1кг Русский пакет\\12",
                    "code": "28185",
                    "price": "49.9",
                    "plu": "0",
                    "barcode": "4607046120424"
                },
                {
                    "name": "Сахар-Песок\\50кг",
                    "code": "10005",
                    "price": "49.9",
                    "plu": "3",
                    "barcode": "4607046120158"
                },
                {
                    "name": "Сода пищевая 0,5кг (бум.п)\\30***",
                    "code": "10006",
                    "price": "26.5",
                    "plu": "0",
                    "barcode": "4607063460015"
                },
                {
                    "name": "Сода пищевая 0,5кг (бум.п)\\30***",
                    "code": "10006",
                    "price": "26.5",
                    "plu": "0",
                    "barcode": "4640001890031"
                },
                {
                    "name": "Соль морск.Помол№0 МЕЛ.Йод'Marbelle'750г\\14ш",
                    "code": "75147",
                    "price": "83.5",
                    "plu": "0",
                    "barcode": "4607012291400"
                },
                {
                    "name": "Соль морск.Помол№0 МЕЛКАЯ'Marbelle'750г\\14ш",
                    "code": "45676",
                    "price": "83.5",
                    "plu": "0",
                    "barcode": "4607012291394"
                },
                {
                    "name": "Соль морск.Помол№0'Marbelle'150г\\80шт",
                    "code": "47021",
                    "price": "47.5",
                    "plu": "0",
                    "barcode": "4607012291202"
                },
                {
                    "name": "Соль морск.Помол№0'Marbelle'80г\\80ш",
                    "code": "45678",
                    "price": "47.9",
                    "plu": "0",
                    "barcode": "4607012291424"
                },
                {
                    "name": "Соль морск.Помол№1 СРЕДНЯЯ'Marbelle'750г\\14ш",
                    "code": "47229",
                    "price": "83.5",
                    "plu": "0",
                    "barcode": "4607012291165"
                },
                {
                    "name": "Соль морск.Помол№3 КРУПНАЯ'Marbelle'750г\\14ш",
                    "code": "47231",
                    "price": "58.5",
                    "plu": "0",
                    "barcode": "4607012291172"
                },
                {
                    "name": "Соль фас.Зол.Зубр Полес.Йод. карт/ пач  0,5кг\\32шт",
                    "code": "79857",
                    "price": "9.4",
                    "plu": "0",
                    "barcode": "4607005090669"
                },
                {
                    "name": "Соль фас.Зол.Зубр Полес.Йод. карт/ пач  0,5кг\\32шт",
                    "code": "79857",
                    "price": "9.4",
                    "plu": "0",
                    "barcode": "4810023000118"
                },
                {
                    "name": "Соль фас.Экстра Полес.йод. п\\э пак 1кг\\20кг",
                    "code": "20210",
                    "price": "14.9",
                    "plu": "0",
                    "barcode": "4810023000156"
                },
                {
                    "name": "Соль фас.Экстра Полес.йод. п\\э пак 1кг\\20кг",
                    "code": "20210",
                    "price": "14.9",
                    "plu": "0",
                    "barcode": "4820078360044"
                },
                {
                    "name": "Соль фас.Экстра Полес.нейод. п\\э пак 1кг\\20кг",
                    "code": "10010",
                    "price": "14.9",
                    "plu": "0",
                    "barcode": "2100000389735"
                },
                {
                    "name": "Соль фас.Экстра Полес.нейод. п\\э пак 1кг\\20кг",
                    "code": "10010",
                    "price": "14.9",
                    "plu": "0",
                    "barcode": "4810023000149"
                },
                {
                    "name": "Соль фас.Экстра Полес.нейод. п\\э пак 1кг\\20кг",
                    "code": "10010",
                    "price": "14.9",
                    "plu": "0",
                    "barcode": "4820078360037"
                },
                {
                    "name": "Соль черная пищевая  100г\\82шт Смол",
                    "code": "76898",
                    "price": "33.5",
                    "plu": "0",
                    "barcode": "1056614410024"
                },
                {
                    "name": "Соль черная пищевая  40г\\98шт Смол.",
                    "code": "10011",
                    "price": "16.9",
                    "plu": "0",
                    "barcode": "1056614410017"
                },
                {
                    "name": "Мука В\\С  АНТОШКА 10кг\\ЦЕНА ЗА МЕШОК",
                    "code": "25833",
                    "price": "329",
                    "plu": "0",
                    "barcode": ""
                },
                {
                    "name": "Мука В\\С  АНТОШКА Ярославль 5кг\\ЦЕНА ЗА МЕШОК",
                    "code": "51922",
                    "price": "164.5",
                    "plu": "0",
                    "barcode": ""
                },
                {
                    "name": "Мука В\\С г.Ярославль 10кг\\ЦЕНА ЗА МЕШОК",
                    "code": "23510",
                    "price": "325",
                    "plu": "0",
                    "barcode": ""
                },
                {
                    "name": "Мука В\\С г.Ярославль\\50кг",
                    "code": "10020",
                    "price": "32.5",
                    "plu": "1 051",
                    "barcode": ""
                },
                {
                    "name": "Мука Нижний Новгород В\\С \\50кг",
                    "code": "62688",
                    "price": "29.9",
                    "plu": "4 017",
                    "barcode": ""
                },
                {
                    "name": "Мука Пшен В\\С Петровские Нивы\\50кг",
                    "code": "19889",
                    "price": "33.9",
                    "plu": "2 440",
                    "barcode": ""
                },
                {
                    "name": "Мука Ржаная Тамбовская обл/45кг",
                    "code": "36921",
                    "price": "22.9",
                    "plu": "2 625",
                    "barcode": ""
                },
                {
                    "name": "Мука Ржаная Тверь 1кг /45кг",
                    "code": "85727",
                    "price": "22.9",
                    "plu": "2 627",
                    "barcode": ""
                },
                {
                    "name": "Мука Фасов.Аладушкин В\\С \\5кг ЦЕНА ЗА МЕШОК",
                    "code": "91457",
                    "price": "212.5",
                    "plu": "0",
                    "barcode": "4600819113517"
                },
                {
                    "name": "Мука Фасов.Аладушкин В\\С 10кг\\ЦЕНА ЗА МЕШОК",
                    "code": "94736",
                    "price": "425",
                    "plu": "0",
                    "barcode": "4600819113524"
                },
                {
                    "name": "Сахар-песок 5кг !!!\\1*50  ЭКОНОМ бел.меш",
                    "code": "69833",
                    "price": "249.5",
                    "plu": "0",
                    "barcode": "4600528340686"
                },
                {
                    "name": "Мука в\\с Кристалл Выпекайка ГОСТ \\50кг",
                    "code": "28962",
                    "price": "32.5",
                    "plu": "18",
                    "barcode": "4605496012122"
                },
                {
                    "name": "Соль пищ. Руссоль помол №1 В/С  п/э 1 кг / 30 шт",
                    "code": "15350",
                    "price": "11.5",
                    "plu": "0",
                    "barcode": "4610007350068"
                },
                {
                    "name": "Соль пищ. Руссоль помол №1 В/С  п/э 1 кг / 30 шт",
                    "code": "15350",
                    "price": "11.5",
                    "plu": "0",
                    "barcode": "5900084237512"
                },
                {
                    "name": "Сахар Мистраль 500г Демерара коричневый",
                    "code": "94289",
                    "price": "122.9",
                    "plu": "0",
                    "barcode": "4601916005408"
                },
                {
                    "name": "Сахар Мистраль 500г Демерара коричневый",
                    "code": "94289",
                    "price": "122.9",
                    "plu": "0",
                    "barcode": "5030917080623"
                },
                {
                    "name": "Соль фас.Тыретск. Йод.1 помол п\\э пак 1кг\\20ш",
                    "code": "20041",
                    "price": "11.5",
                    "plu": "0",
                    "barcode": "2800000103361"
                },
                {
                    "name": "Соль фас.Тыретск. Йод.1 помол п\\э пак 1кг\\20ш",
                    "code": "20041",
                    "price": "11.5",
                    "plu": "0",
                    "barcode": "4620000636254"
                },
                {
                    "name": "Соль фас.Тыретск. Йод.1 помол п\\э пак 1кг\\20ш",
                    "code": "20041",
                    "price": "11.5",
                    "plu": "0",
                    "barcode": "4620001130177"
                },
                {
                    "name": "Соль фас.Тыретск. Йод.1 помол п\\э пак 1кг\\20ш",
                    "code": "20041",
                    "price": "11.5",
                    "plu": "0",
                    "barcode": "4670004013878"
                },
                {
                    "name": "Сахар -пресован.коричн.Брауни Light 0,5кг\\12",
                    "code": "81091",
                    "price": "86.5",
                    "plu": "0",
                    "barcode": "4607046121155"
                },
                {
                    "name": "Сахар рафинированный тросниковый кубики 500г Мистраль\\16",
                    "code": "80508",
                    "price": "68.9",
                    "plu": "0",
                    "barcode": "2810003955843"
                },
                {
                    "name": "Сахар рафинированный тросниковый кубики 500г Мистраль\\16",
                    "code": "80508",
                    "price": "68.9",
                    "plu": "0",
                    "barcode": "4601916004227"
                },
                {
                    "name": "Сахар прессованный Фигурный \\25кг",
                    "code": "98878",
                    "price": "87.9",
                    "plu": "3 448",
                    "barcode": ""
                },
                {
                    "name": "Соль черная пищевая Никитинская  100г\\82шт Смол",
                    "code": "13853",
                    "price": "28.1",
                    "plu": "0",
                    "barcode": "1056614410079"
                },
                {
                    "name": "Соль черная пищевая Никитинская  100г\\82шт Смол",
                    "code": "13853",
                    "price": "28.1",
                    "plu": "0",
                    "barcode": "2900000117211"
                },
                {
                    "name": "Соль черная пищевая Никитинская  100г\\82шт Смол",
                    "code": "13853",
                    "price": "28.1",
                    "plu": "0",
                    "barcode": "4606782071519"
                },
                {
                    "name": "Сахар-песок 5кг фас. !! МЕШОК",
                    "code": "38868",
                    "price": "249.5",
                    "plu": "0",
                    "barcode": "1098624401654"
                },
                {
                    "name": "Соль фас.Тыретск. 1помол  п\\э пак 1кг\\50ш",
                    "code": "19719",
                    "price": "11.5",
                    "plu": "0",
                    "barcode": "4612529500075"
                },
                {
                    "name": "Соль фас.Тыретск. 1помол  п\\э пак 1кг\\50ш",
                    "code": "19719",
                    "price": "11.5",
                    "plu": "0",
                    "barcode": "4620001130160"
                },
                {
                    "name": "Сахар-песок 1кг бум.пакет Беларусь\\10",
                    "code": "11237",
                    "price": "49.9",
                    "plu": "0",
                    "barcode": "4810026000023"
                },
                {
                    "name": "Сахар-песок 1кг бум.пакет Беларусь\\10",
                    "code": "11237",
                    "price": "49.9",
                    "plu": "0",
                    "barcode": "4810272002888"
                },
                {
                    "name": "Сахар -песок коричн.Брауни Dark 0,900кг\\12",
                    "code": "49824",
                    "price": "149.5",
                    "plu": "0",
                    "barcode": "4605496011705"
                },
                {
                    "name": "Сахар-песок 1кг бум. пакет\\10шт\\Жабинковский СЗ",
                    "code": "16680",
                    "price": "49.9",
                    "plu": "0",
                    "barcode": "4810026000481"
                },
                {
                    "name": "Соль Руссоль Экстра 1кг бум.пак. фас. /10 шт.",
                    "code": "22248",
                    "price": "19.9",
                    "plu": "0",
                    "barcode": "4610007350679"
                },
                {
                    "name": "Сахар-песок 5кг бум.пак\\1",
                    "code": "30738",
                    "price": "249.5",
                    "plu": "0",
                    "barcode": "4810272003007"
                },
                {
                    "name": "Сахар-Песок\\25кг",
                    "code": "62414",
                    "price": "49.9",
                    "plu": "4 945",
                    "barcode": ""
                },
                {
                    "name": "Соль пищ. Руссоль помол №1 В/С  ЙОД п\\э пак 1кг\\30ш",
                    "code": "17692",
                    "price": "10.5",
                    "plu": "0",
                    "barcode": "4610007350075"
                },
                {
                    "name": "Мука в\\с Кристалл Выпекайка \\10кг",
                    "code": "30640",
                    "price": "325",
                    "plu": "0",
                    "barcode": "4607106950237"
                },
                {
                    "name": "Мука в\\с Кристалл Выпекайка \\10кг",
                    "code": "30640",
                    "price": "325",
                    "plu": "0",
                    "barcode": "4607106950541"
                },
                {
                    "name": "Мука Ржаная Луховицы/ 48 кг.",
                    "code": "33570",
                    "price": "26.5",
                    "plu": "2 100",
                    "barcode": ""
                },
                {
                    "name": "Соль пищевая помол №1 1сорт Руссоль (ВЕСОВАЯ) /50кг",
                    "code": "58793",
                    "price": "8",
                    "plu": "2 394",
                    "barcode": ""
                },
                {
                    "name": "Мука Ржаная г.Киров/45 кг.",
                    "code": "85421",
                    "price": "22.9",
                    "plu": "1 276",
                    "barcode": ""
                },
                {
                    "name": "Мука 2 СОРТ г.Елец\\50кг",
                    "code": "71084",
                    "price": "29.5",
                    "plu": "1 279",
                    "barcode": ""
                },
                {
                    "name": "Соль 1 помол 1кг картонная пачка Таганрог /20 шт.",
                    "code": "16062",
                    "price": "17.9",
                    "plu": "0",
                    "barcode": "4612731470098"
                },
                {
                    "name": "Сахар Чайкофский Ассорти 0,3кг в стиках (60*5гр.)\\10",
                    "code": "44369",
                    "price": "94.5",
                    "plu": "0",
                    "barcode": "4607046121513"
                },
                {
                    "name": "Сахар Кусковой крупный 10 баллов 450г\\18шт",
                    "code": "55962",
                    "price": "31.5",
                    "plu": "0",
                    "barcode": "1098624407908"
                },
                {
                    "name": "Сахар-песок 1кг АКЦИЯ.!!!\\12шт",
                    "code": "54277",
                    "price": "49.9",
                    "plu": "0",
                    "barcode": "1098624411172"
                }
            ]
        })
    } else {
        res.json({
            "result": "success",
            "message": "",
            "group": [
                {
                    "code": "10000",
                    "name": "01.Сахар, Соль, Сода"
                },
                {
                    "code": "10012",
                    "name": "02.Крупы вес."
                },
                {
                    "code": "25877",
                    "name": "02/2.Мука весовая"
                },
                {
                    "code": "10027",
                    "name": "03.Крупы фасов."
                },
                {
                    "code": "25938",
                    "name": "03/2.Мука,мучные смеси фас."
                },
                {
                    "code": "10069",
                    "name": "04.Макароны весовые"
                },
                {
                    "code": "10087",
                    "name": "05.Макароны фасов."
                },
                {
                    "code": "10107",
                    "name": "06.Масло подс."
                },
                {
                    "code": "10129",
                    "name": "07.Майонез"
                },
                {
                    "code": "10165",
                    "name": "08.Масло слив.,спреды, маргарины +"
                },
                {
                    "code": "10207",
                    "name": "09.Сыр +"
                },
                {
                    "code": "10208",
                    "name": "10.Сырки плавл +"
                },
                {
                    "code": "10224",
                    "name": "11.Сырки и массы творожн. +"
                },
                {
                    "code": "10243",
                    "name": "12.Йогурты,дрожжи +"
                },
                {
                    "code": "10264",
                    "name": "13.Молоко... +"
                },
                {
                    "code": "10385",
                    "name": "14.Заморозка"
                },
                {
                    "code": "10560",
                    "name": "15.Окорока, Куры,Мясо"
                },
                {
                    "code": "10587",
                    "name": "16.Рыба с\\м, морепродукты"
                },
                {
                    "code": "26664",
                    "name": "16/1 Рыба копченая весовая, вяленая,филе"
                },
                {
                    "code": "16805",
                    "name": "16/2 Рыба охлажденная, живая"
                },
                {
                    "code": "10787",
                    "name": "16/3 Пресервы,икра рыбная,рыба соленая,рыба фасов."
                },
                {
                    "code": "10602",
                    "name": "17.Яйцо"
                },
                {
                    "code": "10607",
                    "name": "18.Консервы молочные +"
                },
                {
                    "code": "76229",
                    "name": "19.Консервы мясные"
                },
                {
                    "code": "10644",
                    "name": "20.Консервы рыбные"
                },
                {
                    "code": "10675",
                    "name": "21.Консервы овощные"
                },
                {
                    "code": "10809",
                    "name": "23.Соусы,Кетчупы, все для суши"
                },
                {
                    "code": "10899",
                    "name": "24.Напитки безалк."
                },
                {
                    "code": "11109",
                    "name": "25.Кофе"
                },
                {
                    "code": "11197",
                    "name": "26.Чай"
                },
                {
                    "code": "11334",
                    "name": "27.Роллтон"
                },
                {
                    "code": "35534",
                    "name": "28.Прочее бп"
                },
                {
                    "code": "11370",
                    "name": "29.Супы,подуш,СПЕЦИИ..."
                },
                {
                    "code": "11411",
                    "name": "30.Карт.хруст, чипсы, сухарики,орех"
                },
                {
                    "code": "82483",
                    "name": "31.Кондитерка ИП Павлов"
                },
                {
                    "code": "11580",
                    "name": "32.Кондитерка ИП Гусев"
                },
                {
                    "code": "82484",
                    "name": "32/2. Кондитерка Сторонняя"
                },
                {
                    "code": "14325",
                    "name": "32/25 Волжский кондитер Зефир, Мармелад,Кексы"
                },
                {
                    "code": "12052",
                    "name": "32/3.Торты"
                },
                {
                    "code": "12169",
                    "name": "33.Прикассовая зона"
                },
                {
                    "code": "66347",
                    "name": "34.Сигареты"
                },
                {
                    "code": "12348",
                    "name": "35.Бумага туал,салфетки"
                },
                {
                    "code": "12361",
                    "name": "36.Детское питание"
                },
                {
                    "code": "63073",
                    "name": "36/1.Диетическое и Здоровое питание"
                },
                {
                    "code": "67979",
                    "name": "37.Корма д\\животных"
                },
                {
                    "code": "12496",
                    "name": "38.Алкоголь"
                },
                {
                    "code": "12865",
                    "name": "39.Колбаса,колбасные изделия"
                },
                {
                    "code": "13010",
                    "name": "40.Овощи, фрукты"
                },
                {
                    "code": "13072",
                    "name": "41.Хлеб"
                },
                {
                    "code": "41636",
                    "name": "42.Салаты, полуфабрикаты"
                },
                {
                    "code": "13119",
                    "name": "43.Прочее"
                },
                {
                    "code": "13159",
                    "name": "44.Химия"
                },
                {
                    "code": "70819",
                    "name": "47.Газеты, журналы"
                },
                {
                    "code": "49314",
                    "name": "48.Канцтовары"
                },
                {
                    "code": "76094",
                    "name": "70.Книги"
                },
                {
                    "code": "36121",
                    "name": "71.Фото,Сувениры, открытки,праздничные товары"
                },
                {
                    "code": "76112",
                    "name": "72. Хозтовары"
                },
                {
                    "code": "77570",
                    "name": "75.Одежда"
                },
                {
                    "code": "77139",
                    "name": "76. Домашний текстиль"
                },
                {
                    "code": "77894",
                    "name": "77.Игрушки"
                },
                {
                    "code": "78879",
                    "name": "78.Детские товары"
                },
                {
                    "code": "35895",
                    "name": "79.Постельное белье и полотенце"
                },
                {
                    "code": "22000",
                    "name": "90.Уценка нов."
                },
                {
                    "code": "30530",
                    "name": "91.Упаковка,Тара,Оформ.д-тов.."
                },
                {
                    "code": "55930",
                    "name": "92.Позиции на ВЫВОД - Внимание!"
                },
                {
                    "code": "30544",
                    "name": "99/1.Допродажа"
                },
                {
                    "code": "31839",
                    "name": "99/2.Допродажа Временно Папками!! (обратите внимание)"
                },
                {
                    "code": "900 000",
                    "name": "Я-Перенесенные товары"
                },
                {
                    "code": "30795",
                    "name": "ЯЯЯ"
                }
            ]
        })
    }
});

app.post('/TSD*/hs/tsd/pricetag/POST', (req, res) => {
    logger.info(req.hostname + " запрос информации по ценникам для магазина")
    res.contentType("application/json")
    res.json([
        {
            "barcode": "2210005001232",
            "found": true,
            "code": "10005",
            "plu": 3,
            "string1": "Сахарный песок",
            "string2": "1 кг",
            "string3": "",
            "string4": "",
            "manufacturer": "Россия",
            "price": 49.9,
            "stock": 0,
            "nodiscount": true
        },
        {
            "barcode": "10005",
            "found": true,
            "code": "10005",
            "plu": 3,
            "string1": "Сахарный песок",
            "string2": "1 кг",
            "string3": "",
            "string4": "",
            "manufacturer": "Россия",
            "price": 49.9,
            "stock": 0,
            "nodiscount": true
        },
        {
            "barcode": "10006",
            "found": true,
            "code": "10006",
            "plu": 0,
            "string1": "Сода пищевая",
            "string2": "500 г",
            "string3": "",
            "string4": "",
            "manufacturer": "г. Стерлитамак",
            "price": 26.5,
            "stock": 0,
            "nodiscount": false
        }
    ])
})

app.listen(httpPort, () =>
    logger.info('Express.js listening on port 3000.'))

